//  0. Вывести квадрат числа

Console.WriteLine("Введите число: ");
int num = Convert.ToInt32(Console.ReadLine());

System.Console.WriteLine($"Квадрат числа {num} равен {num*num}");


// hard Напишите программу, которая принимает на вход целое число любой разряднсти и удаляет вторую цифру слева направо этого числа